git init -> превращает текущую директорию в гит репоситорий (создается директория .git)
git add (. - все файлы, так же можчно указать просто файл(его название)) -> отслеживание всех файлов
git commit -m "coment"  ->  совершает сохранение (добавляет комментарий) в git.  всех файлов которые находятс яв индексе. 
git log -> выводит журнал (log) сохранений 
git status  -> показывает статус наших файлов 
git remote  add  origin SSH (ссылка на удаленный репозиторий) - создает связь 
git checkout hash_commit -> переклбчение на определенную версию , просматривание преыддущей версии
git branch -> выводит список всех веток, звездочкой помечается актуальная ветка. 
git chekout <название_ветки>  - переключиться на новую ветку
git switch <название ветки> - переход на указанную ветку
git push origin master -> отправка версии кода на удаленный репозиторий 
git clone <ссыка на удаленный репозиторий> - склонировать репозиторий 
 
